In [1]:
import pandas as pd

In [4]:
b=pd.Series([1,2,3,4,5,6,7])

In [5]:
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [7]:
b.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
b.index=["a","b","c","d","e","f","f"]

In [11]:
b.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'f'], dtype='object')

In [13]:
b

a    1
b    2
c    3
d    4
e    5
f    6
f    7
dtype: int64

In [26]:
pddic={
    "maruti":[2000],
    "Bmw":[5000],
    "jaguar":[6000],
    "verna":[3000]
}

In [27]:
pddic

{'maruti': [2000], 'Bmw': [5000], 'jaguar': [6000], 'verna': [3000]}

In [28]:
pddic.values

In [29]:
a=pd.Series(pddic)

In [30]:
a

maruti    [2000]
Bmw       [5000]
jaguar    [6000]
verna     [3000]
dtype: object

In [31]:
a.values

array([list([2000]), list([5000]), list([6000]), list([3000])],
      dtype=object)

In [32]:
a.index

Index(['maruti', 'Bmw', 'jaguar', 'verna'], dtype='object')

In [59]:
pddic2={
    "max":[100,100,100,100,100],
    "mid_I":[91,45,15,7,8],
    "mid_II":[45,44,58,69,96],
    "final":[90,97,98,94,95]
    
}

In [60]:
pddic2

{'max': [100, 100, 100, 100, 100],
 'mid_I': [91, 45, 15, 7, 8],
 'mid_II': [45, 44, 58, 69, 96],
 'final': [90, 97, 98, 94, 95]}

In [61]:
b1=pd.DataFrame(pddic2)

In [62]:
b1

   max  mid_I  mid_II  final
0  100     91      45     90
1  100     45      44     97
2  100     15      58     98
3  100      7      69     94
4  100      8      96     95

In [63]:
b1.index

RangeIndex(start=0, stop=5, step=1)

In [64]:
b1.index=["math","chemistry","physics","hindi","english"]

In [65]:
b1

           max  mid_I  mid_II  final
math       100     91      45     90
chemistry  100     45      44     97
physics    100     15      58     98
hindi      100      7      69     94
english    100      8      96     95

In [70]:
b1["mid_I"]

math         91
chemistry    45
physics      15
hindi         7
english       8
Name: mid_I, dtype: int64

In [73]:
b1["final"]

math         90
chemistry    97
physics      98
hindi        94
english      95
Name: final, dtype: int64

In [74]:
#loc,iloc

In [80]:
b1.iloc[[1,2]]

           max  mid_I  mid_II  final
chemistry  100     45      44     97
physics    100     15      58     98

In [102]:
b1[["max","final"]]

           max  final
marksheet
math       100     90
chemistry  100     97
physics    100     98
hindi      100     94
english    100     95

In [106]:
b1["mid_I"]>40

marksheet
math          True
chemistry     True
physics      False
hindi        False
english      False
Name: mid_I, dtype: bool

In [115]:
b1[b1["mid_I"]>40] and b1[b1['mid_I']<95]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [86]:
b1.index.name="marksheet"

In [87]:
b1.to_csv("c1.csv")

In [88]:
b2=pd.read_csv("c1.csv")

#head,tail,info,columns,rows

In [91]:
b2.info

<bound method DataFrame.info of    marksheet  max  mid_I  mid_II  final
0       math  100     91      45     90
1  chemistry  100     45      44     97
2    physics  100     15      58     98
3      hindi  100      7      69     94
4    english  100      8      96     95>

In [93]:
b2.head()

   marksheet  max  mid_I  mid_II  final
0       math  100     91      45     90
1  chemistry  100     45      44     97
2    physics  100     15      58     98
3      hindi  100      7      69     94
4    english  100      8      96     95

In [95]:
b2.tail()

   marksheet  max  mid_I  mid_II  final
0       math  100     91      45     90
1  chemistry  100     45      44     97
2    physics  100     15      58     98
3      hindi  100      7      69     94
4    english  100      8      96     95

In [98]:
b2.columns

Index(['marksheet', 'max', 'mid_I', 'mid_II', 'final'], dtype='object')

In [101]:
b2

   marksheet  max  mid_I  mid_II  final
0       math  100     91      45     90
1  chemistry  100     45      44     97
2    physics  100     15      58     98
3      hindi  100      7      69     94
4    english  100      8      96     95

In [118]:
b2[["max","final"]]

   max  final
0  100     90
1  100     97
2  100     98
3  100     94
4  100     95

In [119]:
type(b2)

pandas.core.frame.DataFrame

In [120]:
b2

   marksheet  max  mid_I  mid_II  final
0       math  100     91      45     90
1  chemistry  100     45      44     97
2    physics  100     15      58     98
3      hindi  100      7      69     94
4    english  100      8      96     95

In [125]:
b2[(b2['final']>=95) & (b2['final']<98)]

   marksheet  max  mid_I  mid_II  final
1  chemistry  100     45      44     97
4    english  100      8      96     95

In [ ]:
manoharji=9079724483

In [135]:
import pandas as pd

In [136]:
d3=pd.read_csv("d1.csv")

In [137]:
d3

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [140]:
d3["Employees"].sum()

90

In [144]:
d3["State"].nunique()

4

In [145]:
d3["State"].unique()

array(['CA 94114', 'CA 94119', 'California 94114', 'California'],
      dtype=object)

In [146]:
new_d3=d3[["ID","Employees"]]

In [147]:
new_d3

   ID  Employees
0   1          8
1   2         15
2   3         25
3   4         10
4   5         12
5   6         20

In [148]:
new_d3.sort_values("Employees")

   ID  Employees
0   1          8
3   4         10
4   5         12
1   2         15
5   6         20
2   3         25

In [157]:
new_d3.sort_values("Employees",ascending="False")

   ID  Employees
0   1          8
3   4         10
4   5         12
1   2         15
5   6         20
2   3         25

In [183]:
new_d3.describe()

             ID  Employees
count  6.000000   6.000000
mean   3.500000  15.000000
std    1.870829   6.449806
min    1.000000   8.000000
25%    2.250000  10.500000
50%    3.500000  13.500000
75%    4.750000  18.750000
max    6.000000  25.000000

In [184]:
d3

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [186]:
d4=d3[["ID","Name","Address","Employees"]]
d4

   ID         Name          Address  Employees
0   1      Madeira     3666 21st St          8
1   2  Bready Shop   735 Dolores St         15
2   3  Super River      332 Hill St         25
3   4   Ben's Shop     3995 23rd St         10
4   5      Sanchez  1056 Sanchez St         12
5   6   Richvalley  551 Alvarado St         20

In [187]:
d4["upper"]=d4["Name"].str.upper()

<ipython-input-187-7dc2f04c02a0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d4["upper"]=d4["Name"].str.upper()

In [188]:
d4["lower"]=d4["Name"].str.lower()

<ipython-input-188-dae44b9977a9>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d4["lower"]=d4["Name"].str.lower()

In [182]:
d4

   ID         Name          Address  Employees        upper        lower
0   1      Madeira     3666 21st St          8      MADEIRA      madeira
1   2  Bready Shop   735 Dolores St         15  BREADY SHOP  bready shop
2   3  Super River      332 Hill St         25  SUPER RIVER  super river
3   4   Ben's Shop     3995 23rd St         10   BEN'S SHOP   ben's shop
4   5      Sanchez  1056 Sanchez St         12      SANCHEZ      sanchez
5   6   Richvalley  551 Alvarado St         20   RICHVALLEY   richvalley